OdDAI.TypeOrRule.parentSchema
\details
Retrieves a parent schema definition of underlying instance.
\returns A raw pointer to parent schema definition for underlying instance, which is Named Type or Global Rule.
\remarks
Underlying type member function.

OdDAI.TypeOrRule.originalName
\details
Retrieves an original name of underlying instance as it is defined within EXPRESS schema.
\returns An OdAnsiString that contains an original name of underlying instance, which is Named Type or Global Rule.
\remarks
Underlying type member function.

OdDAI.TypeOrRule.name
\details
Retrieves a name of underlying instance.
\returns An OdAnsiString that contains a name of underlying instance, which is Named Type or Global Rule.
\remarks
Underlying type member function.

OdDAI.TypeOrRule.globalRule
\details
Retrieves an underlying Global Rule if it is contained within TypeOrRule.
\returns A raw pointer to GlobalRule instance if it is contained within TypeOrRule, or nullptr otherwise.

OdDAI.TypeOrRule.isGlobalRule
\details
Determines if TypeOrRule instance contains underlying Global Rule instance.
\returns true it TypeOrRule instance contains underlying Global Rule, otherwise returns false.

OdDAI.TypeOrRule.namedType
\details
Retrieves an underlying Named Type if it is contained within TypeOrRule.
\returns A raw pointer to NamedType instance if it is contained within TypeOrRule, or nullptr otherwise.

OdDAI.TypeOrRule.isNamedType
\details
Determines if TypeOrRule instance contains underlying Named Type instance.
\returns true it TypeOrRule instance contains underlying Global Rule, otherwise returns false.

OdDAI.TypeOrRule.kind
\details
Retrieves a determinant of underlying instance.
\returns TypeOrRuleKind which determines a kind of underlying instance.

OdDAI.TypeOrRule.unset
\details
Unsets an instance of TypeOrRule.

OdDAI.TypeOrRule.exists
\details
Retrieves if instance of TypeOrRule is unset or not.
\returns 0 if instance of TypeOrRule is unset, otherwise returns 1.

OdDAI.TypeOrRule.#ctor
\details
Default constructor.

OdDAI.TypeOrRule
\details
Container for selection between Named Type or Global Rule.